# -*- coding: utf-8 -*-

ques_ans = [
    # ("ఆసియా క్రీడల్లో పురుషుల ట్రాప్‌ టీమ్‌ విభాగంలో  కైనన్‌ చెనాయ్, జొరావర్‌ సింగ్‌ సంధూ, పృథ్వీరాజ్‌ తొండైమన్‌లతో కూడిన భారత జట్టు 361 పాయింట్లతో అగ్రస్థానంలో నిలిచి స్వర్ణ పతకాన్ని సాధించింది. మహిళల ట్రాప్‌ టీమ్‌ ఈవెంట్‌లో రాజేశ్వరి కుమారి, మనీశా కీర్, ప్రీతి రజక్‌లతో కూడిన భారత జట్టు 337 పాయింట్లతో రెండో స్థానంలో నిలిచి రజత పతకం కైవసం చేసుకుంది. ఆసియా క్రీడల్లో పురుషుల ట్రాప్‌ టీమ్‌ విభాగంలో  కైనన్‌ చెనాయ్, జొరావర్‌ సింగ్‌ సంధూ, పృథ్వీరాజ్‌ తొండైమన్‌లతో కూడిన భారత జట్టు 361 పాయింట్లతో అగ్రస్థానంలో నిలిచి స్వర్ణ పతకాన్ని సాధించింది. మహిళల ట్రాప్‌ టీమ్‌ ఈవెంట్‌లో రాజేశ్వరి కుమారి, మనీశా కీర్, ప్రీతి రజక్‌లతో కూడిన భారత జట్టు 337 పాయింట్లతో రెండో స్థానంలో నిలిచి రజత పతకం కైవసం చేసుకుంది.")
    # ("ఆసియా క్రీడల్లో పురుషుల ట్రాప్‌ టీమ్‌ విభాగంలో  కైనన్‌ చెనాయ్, జొరావర్‌ సింగ్‌ సంధూ, పృథ్వీరాజ్‌ తొండైమన్‌లతో కూడిన భారత జట్టు 361 పాయింట్లతో అగ్రస్థానంలో నిలిచి స్వర్ణ పతకాన్ని సాధించింది. మహిళల ట్రాప్‌ టీమ్‌ ఈవెంట్‌లో రాజేశ్వరి కుమారి, మనీశా కీర్, ప్రీతి రజక్‌లతో కూడిన భారత జట్టు 337 పాయింట్లతో రెండో స్థానంలో నిలిచి రజత పతకం కైవసం చేసుకుంది."),
    ("ఆసియా క్రీడల్లో మహిళల హెప్టాథ్లాన్‌ ఈవెంట్‌లో నందిని మూడో స్థానంలో నిలిచి కంచు పతకాన్ని సొంతం చేసుకుంది."),
    ("ఆసియా క్రీడల్లో మహిళల 100 మీటర్స్‌ హర్డిల్స్‌లో జ్యోతి యర్రాజీకి రజత పతకం దక్కింది."),
    ("ఆసియా క్రీడల్లో  భారత పురుషుల బ్యాడ్మింటన్‌ జట్టు ఫైనల్లో   చైనా చేతిలో ఓడి ర‌జిత ప‌త‌కంతో స‌రిపెట్టుకుంది."),
    # ("ఆసియాక్రీడల్లో భారత గోల్ఫర్‌ అదితి అశోక్  మహిళల గోల్ఫ్ పోటీలో  రజత పతకం కైవసం చేసుకుంది."),
    # ("ఆసియా క్రీడల్లో 3000 మీటర్ల స్టీపుల్‌ఛేజ్‌ పురుషుల విభాగంలో  అవినాశ్‌ సాబ్లే  స్వర్ణ పతకంతో మెరిసాడు. పురుషుల షాట్‌పుట్‌లో తజీందర్‌పాల్‌ సింగ్‌ తూర్‌  స్వర్ణంతో మెరిసాడు. పురుషుల లాంగ్‌జంప్‌లో భారత ఆటగాడు మురళీ శ్రీశంకర్‌ రజత పతకాన్ని గెలుచుకున్నాడు."),
    # ("ఆసియా క్రీడల్లో మాధురి 800 మీటర్ల పరుగులో మాధురి సింగ్‌ రజత పతకం సాధించింది. పురుషుల 1500 మీటర్ల పరుగులో ఉత్తరప్రదేశ్‌కు చెందిన అజయ్‌ కుమార్‌ సరోజ్, కేరళ అథ్లెట్‌ జిన్సన్‌ జాన్సన్‌ రెండు, మూడు స్థానాల్లో నిలిచి రజత, కాంస్యాలు సొంతం చేసుకున్నారు. మహిళల డిస్కస్‌ త్రోలో సీమా పూనియా వరుసగా మూడో ఆసియా క్రీడల్లో కాంస్య పతకంతో మెరిసింది."),
    # ("ఆంధ్రప్రదేశ్‌లోని కృష్ణపట్నం–హైదరాబాద్‌ మధ్య రూ.1,932 కోట్లతో చేపట్టే మల్టీ ప్రొడక్ట్‌ పైప్‌లైన్‌ను ప్రధానమంత్రి నరేంద్ర మోదీ ప్రారంభించారు."),
    # ("ఆసియాక్రీడల్లో స్క్వాష్‌ పురుషుల టీమ్‌ ఈవెంట్‌లో భారత్‌  పాకిస్తాన్‌పై విజయం సాధించి స్వర్ణ పతకం గెలుచుకుంది."),
    # ("దక్షిణాసియా ఫుట్‌బాల్‌ సమాఖ్య (శాఫ్‌) అండర్‌–19 ఫుట్‌బాల్‌ చాంపియన్‌షిప్‌ను భారత జట్టు గెలుచుకుంది."),
    # ("సెప్టెంబర్‌లో వసూలు చేసిన ఆగస్టు స్థూల వస్తు, సేవల పన్ను జీఎస్టీ 10 శాతం పెరిగి రూ.1,62,712 కోట్లకు చేరుకుంది."),
    # ("వైద్య శాస్త్రంలో విశేష కృషి చేసినందుకుగానూ కాటలిన్‌ కరికో, డ్రూ వెయిస్‌మన్‌కు ప్రతిష్ఠాత్మక నోబెల్‌ పురస్కారం -2023 వరించింది.")
]
