# -*- coding: utf-8 -*-

questions_answers = [
("కన్యాశుల్కం అనే నాటకంను రచించినది ఎవరు ?", "కందుకూరి విరేశలింగం", "కొమర్రాజు లక్ష్మణరావు", "గురజాడ అప్పారావు", "దుగ్గిరాల గోపాలకృష్ణయ్య", "c"),
("గోల్కొండ పత్రిక స్థాపకుడు ఎవరు ?", "ముట్నూరి కృష్ణారావు", "కాశీనాథుని నాగేశ్వరరావు", "సురవరం ప్రతాపరెడ్డి", "భోగరాజు పట్టాభిసీతారామయ్య", "c"),
("'ది కాంగ్రెస్' అను పత్రికను ప్రారంచించినది ?", "ముద్దూరి అన్నపూర్ణయ్య", "సురవరం ప్రతాపరెడ్డి", "ముట్నూరి కృష్ణారావు", "కొండ వెంకటప్పయ్య", "a"),
("మాలపల్లి తెలుగు నవాలా రచయిత ఎవరు ?", "కందుకూరి విరేశలింగం", "గురజాడ అప్పారావు", "కాశీనాథ నాగేశ్వరరావు", "ఉన్నవ లక్ష్మీనారాయణ", "d"),
("నాజీవనయాత్ర గ్రంథంను రచించినది ఎవరు ?", "గరిమేళ్ళ సత్యనారాయణ", "గురజాడ అప్పారావు", "భోగరాజు పట్టాభిసీతారామయ్య", "కందుకూరి విరేశలింగం", "d"),
("తెలుగులో నాటక యోగ్యమైన మొదటి నాటకం ?", "కన్యాశుల్కం", "బ్రహ్మ వివాహం", "ముత్యాల స్వరాలు", "పురుషార్థ ప్రదాయిని", "b"),
("కృష్ణ పత్రిక సంపాదకుడు ఎవరు ?", "కొండ వెంకటప్పయ్య", "ముట్నూరు క్రిష్ణారావు", "సురవరం ప్రతాపరెడ్డి", "దుగ్గిరాల గోపాలకృష్ణయ్య", "b"),
("విజ్ఞాన చంద్రిక గ్రంథమండలిని స్థాపించిదెవరు ?", "భోగరాజు పట్టాభి సీతారామయ్య", "ఆదిరాజు వీరభద్రరావు", "కొమర్రాజు లక్ష్మణరావు", "చిలకమర్తి లక్ష్మీనర్సింహారావు", "c"),
("వేమన పద్యాల్ని ఆంగ్లంలోకి అనువదించిన వారు ఎవరు ?", "మెంకజి", "కాడ్వెల్", "థామస్ మాన్రో", "సి.పి. బ్రౌన్", "d"),
("అంకెలు, విరామ చిహ్నాల్ని తెలుగులో ప్రవేశపెట్టిన వారెవరు ?", "కాంపెబెల్", "సి.పి. బ్రౌన్", "మెకంజి", "కాడ్వెల్", "b"),
("కైఫీయత్తులు అంటే ఏమిటి ?", "రాజకీయ విశేషాలు", "పన్నులు", "గ్రామ చరిత్రలు", "సాహిత్య అంశాలు", "c"),
("ఆంధ్రలో సాంఘిక సంస్కరణోద్యమ పితామహుడు ఎవరు ?", "రాజారామ్మోహన్ రాయ్", "ఈశ్వర చంద్రవిద్యాసాగర్", "కందుకూరి విరేశలింగం", "రఘుపతి వెంకటరత్నంనాయుడు", "c"),
("రఘుపతి వెంకటరత్నం నాయుడు సాంఘిక శుద్ధి సంస్థను ఏ సంవత్సరంలో స్థాపించెను ?", "1881", "1874", "1892", "1891", "d"),
("ఆంధ్రదేశంలో బ్రహ్మ సమాజం కార్య కలాపాలలో చురుకుగా పాల్గొన్న వ్యక్తి ఎవరు ?", "కందుకూరి విరేశలింగం పంతులు", "రాజా రామ్మోహన్ రాయ్", "రఘుపతి వెంకటరత్నం నాయుడు", "గురజాడ అప్పారావు", "c"),
("తెలుగులో వెలువడిన మొట్టమొదటి వ్యాస సంపుటి ?", "హితసూచిని", "కన్యాశుల్కం", "సిజర్ చరిత్ర", "చిత్రరత్నాకర", "a"),
("విరేశలింగం గారిని దక్షిణ భారతదేశ విద్యాసాగరుడు అని సుత్తించినది ?", "ఆరుద్ర", "చీలకమర్తి లక్ష్మీనరసింహం", "మహాదేవ గోవిందరనడే", "శ్రీశ్రీ", "c"),
("ఈ క్రింది వానిలో వీరేశలింగం గారి రచన కానిది ?", "రాజశేఖర్ చరిత్ర", "స్వీయచరిత్ర", "కన్యాశుల్కం", "సత్యరాజా పూర్వదేశయాత్రలు", "c"),
("ఈ క్రింది వానిలో రఘుపతి వెంకటరత్నంనాయుడు గారు నడిపిన పత్రిక కానిది ?", "ఫెలోసర్కర్", "బ్రహ్మప్రకాశిక", "పీపుల్స్‌ఫ్రెండ్", "వివేకవర్ధిని", "d"),
("ఆంధ్ర సాహిత్య పరిషత్తును ఏర్పాటు చేసినది ?", "రఘుపతి వెంకటరత్నం నాయుడు", "జయంతి రామయ్య", "గిడుగు రామమూర్తి", "చిలమర్తి లక్ష్మీనర్సింహం", "b"),
("'ఆంధ్రభాషకు అమరసింహుడు' అని కీర్తి పొందిన విదేశీయుడు ఎవరు ?", "థామన్‍మాన్రో", "మెకంజి", "సి.పి. బ్రౌన్", "కాంప్‍బెల్", "c"),
("ఆంధ్రప్రదేశ్‍లో సి.పి. బ్రౌన్ మెమోరియల్ ట్రస్టు లైబ్రరీ ఎక్కడ ఉంది ?", "గుంటూరు", "రాజమండ్రి", "కాకినాడ", "కడప", "d"),
("ఆంధ్రభాషా సంజీవని అనే పత్రికకు సంపాదకత్వం వహించిన వారు ?", "జయంతి రామయ్య", "కందుకూరి వీరేశలింగం", "కొండ వెంకటప్పయ్య", "కొక్కండ వెంకటరత్నంపంతులు", "d"),
("కైఫియత్తుల సేకరణలో ఘనత సాధించిన విదేశీ ప్రముఖుడు ఎవరు ?", "సి.పి. బ్రౌన్", "కాంపెల్", "మెకంజి", "జాన్‍ముర్దాక్", "c"),
("తెలుగులో తొలియాత్ర చరిత్రను రచించింది ?", "వెన్నెల కంటి సుబ్బారావు", "గురజాడ అప్పారావు", "ఏనుగుల వీరస్వామి", "పరవస్తూ వెంకటరంగచార్యులు", "c"),
("ఆంధ్రదేశ చరిత్రను రచించిన తొలి విదేశీయుడు ?", "మెకంజి", "సి.పి. బ్రౌన్", "కాంప్‍బెల్", "జామ్ మార్దాక్", "c"),
("రాజమండ్రిలో సాంఘిక సంస్కరణోద్యమ మండలిని స్థాపించినది ఎవరు ?", "కొక్కండ వెంకటరత్నం", "మద్దూరి అన్నపూర్ణయ్య", "రఘుపతి వెంకటరత్నంనాయుడు", "కందుకూరి వీరేశలింగం", "d"),
("పురుషార్ధ ప్రదాయిని అనే పత్రికను ఎవరు నడిపేవారు ?", "ఉమరంగ నాయకుడు", "కొక్కండ వెంకటరత్నంనాయుడు", "జయంతి రామయ్య", "మద్దూరి అన్నపూర్ణయ్య", "a"),
("అబ్రహంలింకన్ చరిత్ర గ్రంథ రచయిత ఎవరు ?", "దుగ్గిరాల గోపాలకృష్ణయ్య", "అయ్యదేవర కాళేశ్వరరావు", "గాడిచర్ల హరిసర్వోత్తమరావు", "చిలకమర్తి లక్ష్మీనరసింహం", "c"),
("ఈ క్రింది వానిలో గురజాడ రచన కానిది ఏది ?", "కన్యాశుల్కం", "పుత్తడిబొమ్మ", "ఆంధ్రుల కవులచరిత్ర", "ముత్యాల స్వరాలు", "c"),
("ఈ క్రింది వారిలో బ్రహ్మసమాజ త్రయంగ ప్రసిద్ధి చెందని వారు ఎవరు ?", "కందుకూరి విరేశలింగం", "దేశీరాజు పెదపాపయ్య", "శ్రీ గిడుగు రామమూర్తి", "రఘుపతి వెంకటరత్నంనాయుడు", "c"),
("వీర తెలంగాణ - అనుభవాలు జ్ఞాపకాలు గ్రంథ రచయిత ?", "రావి నారాయణరెడ్డి", "పనప్పాకం ఆనందచార్యులు", "సురవరం ప్రతాపరెడ్డి", "కొండ వెంకట రంగారెడ్డి", "a"),
("కాడ్వెల్ ఈ భాష విషయంలో విశేష పరిశోధన జరిపారు ?", "సంస్కృతం", "ఇంగ్లీషు", "హిందీ", "ద్రావీడ భాషలు", "d"),
("తెలుగు జనాన పత్రిక సంపాదకుడు ఎవరు ?", "గిడుగు రామమూర్తి", "మద్దూరి అన్నపూర్ణయ్య", "రాయసం వెంకటశివుడు", "పూండ్ల రామకృష్ణయ్య", "c"),
("బ్రౌన్ రచించిన తాతాచారి కథల్ని పరిష్కరించిన కవి ఎవరు ?", "రాయపోలు సుబ్బారావు", "గురజాడ అప్పారావు", "దేవుళ్ళపల్లి కృష్ణశాస్త్రి", "వేలూరి సుబ్బారావు", "b"),
("ద్రావిడ భాషల తులనాత్మక వ్యాకరణం అనే గ్రంథంను రచించింది ?", "కార్డ్‌వెల్", "సి.పి. బ్రౌన్", "మెకంజి", "థామస్ మాన్రో", "a"),
("ఎ.డి. కాంప్‍బెల్ ఇంగ్లీష్‍లో తెలుగు వ్యాకరణాన్ని ఎప్పుడు అనువదించారు ?", "1816", "1818", "1806", "1826", "a"),
("ఆంగ్లేయుల పరిపాలన కాలంలో ప్రచురించబడిన తొలి తెలుగు పత్రిక ?", "ఆంధ్ర పత్రిక", "సత్యదూత", "సతిహిత బోధిని", "తత్వ బోధిని", "b"),
("జాతీయ పతాక నమూనాను రూపొందించిన తెలుగు వ్యక్తి ?", "ప్రకాశం పంతులు", "రఘుపతి వెంకటరత్నంనాయుడు", "పింగలి వెంకయ్య", "కొమర్రాజు లక్ష్మణరావు", "c"),
("భారత జాతీయ కాంగ్రెస్ చరిత్ర గ్రంథ రచయిత ఎవరు ?", "మహ్మాత్మగాంధీ", "గాడిచర్ల హరిసర్వోత్తమరావు", "దుగ్గిరాల గోపాలకృష్ణయ్య", "భోగరాజు పట్టాభిసీతారామయ్య", "d"),
("కందుకూరి వీరేశలింగం గారు ఏ సంవత్సరంలో జన్మించారు ?", "1862, ఏప్రిల్ 16", "1848, ఏప్రిల్ 16", "1881, డిసెంబర్ 11", "1852, సెప్టెంబర్ 16", "b"),
("వీరేశలింగం గారు ఏ సంవత్సరంలో మద్రాసు ప్రెసిడెన్సి కాలేజిలో మొట్టమొదటి తెలుగు పండితుడిగా నియమించబడినాడు ?", "1881", "1899", "1889", "1871", "b"),
("కందుకూరి వీరేశలింగం గారు మొట్టమొదటి వితంతు వివాహంను ఏ తేదీన జరిపించారు ?", "1891, డిసెంబర్ 11", "1881, డిసెంబర్ 15", "1871, అక్టోబర్ 11", "1881, డిసెంబర్ 11", "d"),
("స్త్రీ విద్యా వ్యాప్తి కోసం 1874లో ఎక్కడ కందుకూరి వీరేశలింగం గారు మొట్టమొదటి సారిగా బాలికల పాఠశాలను స్థాపించారు ?", "కాకినాడ", "రాజమండ్రి", "దవళేశ్వరం", "కోరంగి", "c"),
("దవళేశ్వరంలో ఏర్పాటు కాబడిన బాలికల పాఠశాలకు ఎవరు మొదటి ప్రధానోపాధ్యాయునిగా పని చేశారు ?", "ఇ.పి. మెట్‍కాఫ్", "మల్లాది అచ్చన్నశాస్త్రి", "పైడరామకృష్ణయ్య", "కందుకూరి వీరేశలింగం", "b"),
("వీరేశలింగంఆ గారి సంఘం సంస్కరణ ఉద్యమాలకు ఆర్థిక సహాయం చేసినవారు ఎవరు ?", "ఇ.పి. మెట్‍కాఫ్", "పైడ రామకృష్ణయ్య", "కొమర్రాజు లక్ష్మణరావు", "పీఠాపురం రాజా 1", "b"),
("కందుకూరి వీరేశలింగం గారు స్త్రీ విద్యను ప్రోత్సహించుటకు ప్రారంభించిన పత్రిక పేరు ఏమిటి ?", "హస్య సంజీవని", "సత్యావాధిని", "వివేకవర్ధిని", "తెలుగు జనాన", "c"),
("వీరేశలింగం గారి స్త్రీల కోసం 1883లో ప్రత్యేకంగా ప్రారంభించిన మాస పత్రిక ఏది ?", "సతిహిత భోదిని", "హస్య సంజీవని", "వివేకవర్ధిని", "సత్యవాధిని", "a"),
("వీరేశలింగం గారి సేవలకు మెచ్చి బ్రిటీష్ ప్రభుత్వం రావుబహదూర్ అనే బిరుదు ఎప్పుడు ప్రధానం చేసింది ?", "1881", "1893", "1899", "1892", "b"),
("వీరేశలింగం గారు స్థాపించిన వివిధ సంస్థల నిర్వహణకై హితకారిని సమాజం అనే కేంద్ర సంస్థను ఏ సంవత్సరంలో స్థాపించారు ?", "1908", "41907", "1905", "1878", "c"),
("వీరేశలింగం గారు మహారాజ బాలికల పాఠశాలలో ఏ సంవత్సరంలో మొట్టమొదటి సారిగా వితంతు వివాహంపై ఉపన్యాసం ఇచ్చారు ?", "1878", "1879", "1882", "1880", "b"),
("ఈ క్రింది వానిలో కందుకూరి వీరేశలింగం గారి బిరుదు కానిది ?", "గద్య తిక్కన", "నవయుగ వైతాళికుడు", "ఆంధ్ర వైతాళికుడు", "ఆంధ్ర పునర్వికాస పితామహుడు", "b"),
("కందుకూరి వీరేశలింగం గారు 1894లో రచించిన మొట్ట మొదటి తెలుగు నవల ఏది ?", "నా జీవన యాత్ర", "రాజశేఖర చరిత్ర", "ఆంధ్ర కవుల చరిత్ర", "సత్యరాజ పూర్వదేశ యాత్రలు", "b"),
("At the feet of The Master అనే ఆంగ్ల గ్రంథాన్ని రచించింది ఎవరు ?", "భోగరాజు పట్టాభిసీతారామయ్య", "సర్వేపల్లి రాధకృష్ణన్", "జిడ్డు కృష్ణమూర్తి", "నీలం సంజీవరెడ్డి", "c"),
("1919లో జన్మ భూమి అనే ఆంగ్లవార పత్రికను ప్రారంభించినవారు ఎవరు ?", "ప్రకాశం పంతులు", "భోగరాజు పట్టాభిసీతారామయ్య", "అయ్యదేవర కాళేశ్వరరావు", "రఘుపతి వెంకటరత్నంనాయుడు", "b"),
("ఈ క్రింది వానిలో భోగరాజు పట్టాభి సీతారామయ్య రచించిన గ్రంథం కానిది ఏది ?", "At the feet of the Master", "History Indian Congress", "Gandhii and Gandhism", "Feather and stone", "a"),
("కాశీయాత్ర చరిత్ర అనే గ్రంథం రచించింది ఎవరు ?", "ఏనుగుల వీరస్వామి", "కోలశేషాచల కవి", "సురవరం ప్రతాపరెడ్డి", "దువ్వూరి రామిరెడ్డి", "a"),
("తెలంగాణ పీపుల్ స్ట్రగుల్ & ఇట్స్ లైసెన్స్ అనే గ్రంథ రచయిత ఎవరు ?", "దేవుళపల్లి వెంకటేశ్వరరావు", "రావి నారాయణరెడ్డి", "నార్ల వెంకటేశ్వరరావు", "పుచ్చలపల్లి సుందరయ్య", "d"),
("ట్రాజెడి ఆఫ్ హైదరాబాద్ అనే గ్రంథంను రచించింది ?", "కె. యం. మున్షి", "లాయక్ ఆలి", "సర్వేపల్లి రాధాకృష్ణన్", "పుచ్చలపల్లి సుందరయ్య", "b"),
("నేను నా దేశం గ్రంథ రచయిత ?", "దర్మి చెంచయ్య", "గద్దె లింగయ్య", "తరిమేల నాగిరెడ్డి", "రావి నారాయణరెడ్డి", "a"),
("విప్లవకారులు అనే గ్రంథ రచయిత ?", "దర్శి చెంచయ్య", "గద్దె లింగయ్య", "తరిమేల నాగిరెడ్డి", "రావి నారాయణరెడ్డి", "b"),
("1919లో దిద్దుబాటు అనే పేరుతో తెలుగులో ప్రప్రథమ ఆధునిక కథానికను రచించిన వారు ?", "విరేశలింగం పంతులు", "గురజాడ అప్పారావు", "జయంతి రామయ్య", "గిడుగు రామమూర్తి", "b"),
("వ్యవహారిక భాషోద్యమ పితామహుడిగా ప్రసిద్ధి గాంచిన వారు ఎవరు ?", "విరేశలింగం పంతులు", "గురజాడ అప్పారావు", "జయంతి రామయ్య", "గిడుగు రామమూర్తి", "d"),
("ఈ క్రింది వానిలో గిడుగు రామమూర్తి గారి రచనలు కానివి ?", "బాలకవి శరణ్యం", "వ్యాస మంజరి", "పండిత బిషక్కుల భాష భేషజం", "పుత్తడి బొమ్మ", "d"),
("ఆంధ్రుల చరిత్ర పరిశోధన పితమహుడిగా ప్రసిద్ధి గాంచినవాడు ?", "కొండ వెంకటప్పయ్య", "కొమర్రాజు లక్ష్మణరావు", "జయంతి రామయ్య", "గిడుగు రామమూర్తి", "b"),
("తిలక్ యొక్క కేసరి, మరాఠి వార్తా పత్రికల్లో వ్యాసాలు రాసిన ఏకైక ఆంధ్రుడు ఎవరు ?", "చిలుకూరి వీరభద్రరావు", "కట్టమంచి రామలింగారెడ్డి", "కొమర్రాజు లక్ష్మణరావు", "కాశీనాథుని నాగేశ్వరరావు", "c"),
("ఆంధ్రోద్యమ పితామహుడిగా పేరు గాంచినవాడు ?", "మాడపాటి హనుమంతరావు", "కొండ వెంకటప్పయ్య", "కొండవెంకట రంగారెడ్డి", "పొట్టి శ్రీరాములు", "b"),
("దీ - హిందూ అనే ఆంగ్ల దినపత్రికను స్థాపించిన వ్యవస్థాపకులలో ముఖ్యులు ఎవరు ?", "వీరేశలింగంపంతులు", "న్యాపతి సుబ్బారావు", "భోగరాజు పట్టాభిసీతారామయ్య", "సురవరం ప్రతాపరెడ్డి", "b"),
("ఆంధ్ర పత్రికను 1908లో బొంబాయిలో స్థాపించిన వారు ఎవరు ?", "న్యాపతి సుబ్బారావు", "జయంతి రామయ్య", "కాశీనాథుని నాగేశ్వరరావు", "భోగరాజు పట్టాభిసీతారామయ్య", "c"),
("శ్రీబాగ్ అనేది ఒడంబడిక ఇతని నివాసంలో జరిగింది ?", "కొమర్రాజు లక్ష్మణరావు", "ప్రకాశంపంతులు", "కాశీనాథుని నాగేశ్వరరావు", "వీరేశలింగంపంతులు", "c"),
("సుమతి శతకంను ఆంగ్లంలోకి అనువదించినవారు ఎవరు ?", "థామన్‍మాన్రో", "సి.పి. బ్రౌన్", "మెకంజి", "ఎ.డి. కాంప్‍బెల్", "b"),
("తెలుగు ఈజ్ ఇటాలియన్ ఆఫ్ ది ఈస్ట్ అని పేర్కొన్న వారు ఎవరు ?", "ఆర్థర్ కాటన్", "కాలిన్ మెకంజి", "ఎ.డి. కాంప్‍బెల్", "సి.పి. బ్రౌన్", "d"),
("దవళేశ్వరం వద్ద గోదావరి నదిపై ఆనకట్ట నిర్మాణానికి సంబంధించిన ప్రణాళికను బ్రిటీషు ప్రభుత్వానికి సమర్పించిన వారు ఎవరు ?", "ఆర్థర్ కాటన్", "థామస్ మాన్రో", "కేప్టెన్ ఓర్", "వీనం వీరన్న", "a"),
("విజయవాడ వద్ద నిర్మించబడిన ప్రకాశం బ్యారేజి నిర్మాణంను ప్రముఖంగా సారధ్యం వహింహిన వారు ?", "థామస్ మాన్రో", "వీనం వీరన్న", "ఆర్ధర్ కాటన్", "కేప్టెన్ ఓర్", "d"),
("దవళేశ్వరం బ్యారేజి నిర్మాణంలో కీలక పాత్ర పోషించినవారు ఎవరు ?", "థామస్ మాన్రో", "కెప్టెన్ ఓర్", "వీనం వీరన్న", "సి.పి. బ్రౌన్", "c"),
("రాయలసీమ, నెల్లూరు ప్రాంతాలకు సంబంధించిన దేశపటమును, నైసర్గిక పటమును మొట్టమొదటగా తయారు చేసినవారు ?", "ఆర్ధర్ కాటన్", "కాలిన్ మెకంజి", "సి.పి. బ్రౌన్", "కాల్డ్‌వెల్", "b"),
("స్థానిక గ్రామ చరిత్రను సేకరించిన ప్రముఖ ఆంగ్లేయుడు ఎవరు ?", "కాలిన్ మెకంజి", "ఎ.డి. కాంప్‍బెల్", "సి.పి. బ్రౌన్", "థామస్ మాన్రో", "a"),
("విశ్వనాథ సత్యనారాయణ గారు రచించిన ఏ రచనకు జ్ఞానపీఠ బహుమతిని పొందారు ?", "వేయిపడగలు", "ఆంధ్ర ప్రశస్తి", "శ్రీమద్రామాయణ కల్పవృక్షం", "చెలియకట్ట", "c"),
("ఆచార్య ఎన్.జి. రంగారారు ఎక్కడ భారతీయ రైతు శిక్షణా కేంద్రంను స్థాపించి రాజకీయ తరగతులను నిర్వహించారు ?", "గుంటూరు", "విజయవాడ", "వెంకటగిరి", "నిడుబ్రోలు", "d"),
("1933 - 36 మధ్యకాలంలో ఏ జమీందారులో ఆచార్య ఎన్.జి. రంగాగారు రైతు ఉద్యమమును నిర్వహించారు ?", "నిడుబ్రోలు", "ఫైజ్‍పూర్", "వెంకటగిరి", "గుంటూరు", "c"),
("రైతు బాంధవుడిగా ఖ్యాతి వహించినవారు ?", "ఎన్.జి. రంగా", "కట్టమంచి రామలింగారెడ్డి", "పట్టాభి సీతారామయ్య", "పింగలి వెంకయ్య", "a"),
("అఖిల భారత నేత కార్మికుల సంఘంను స్థాపించిన వారు ?", "పట్టాబీ సీతారామయ్య", "ఎన్.జి. రంగా", "అయ్యదేవర కాళేశ్వరరావు", "న్యాపతి సుబ్బారావు", "b"),
("విశాలాంధ్రలో ప్రజారాజ్యం అనే పుస్తకం రచించిన ప్రముఖ కమ్యూనిష్టు నాయకుడు ఎవరు ?", "సురవరం ప్రతాపరెడ్డి", "రావి నారాయణరెడ్డి", "పుచ్చలపల్లి సుందరయ్య", "చండ్ర రాజేశ్వరరావు", "c"),
("ఆంధ్ర కమ్యూనిష్టు పితమహుడిగా ప్రసిద్ధి గాంచిన వారు ?", "సురవరం ప్రతాపరెడ్డి", "పుచ్చలపల్లి సుందరయ్య", "రావి నారాయణరెడ్ది", "కొవ్విడి లింగరాజు", "b"),
("పుచ్చలపల్లి సుందరయ్య గారు విశాలాంధ్రలో ప్రజా రాజ్యం అనే గ్రంథంను మే సంవత్సరంలో రచించారు ?", "1936", "1938", "1946", "1948", "c"),
("నంద్యాల మహాసభలో దత్త మండలాలకు రాయలసీమగా నామకరణం చేసినవారు ?", "గాడిచర్ల హరిసర్వోత్తమరావు", "టంగుటూరి ప్రకాశంపంతులు", "కాశీనాథుని నాగేశ్వరరావు", "సర్వేపల్లి రాధాకృష్ణ", "a"),
("1921లో స్వరాజ్య అనే పత్రికను స్థాపించిన వారు ?", "న్యాపతి సుబ్బారావు", "ప్రకాశంపంతులు", "గాడిచర్ల హరిసర్వోత్తమరావు", "భోగరాజు పట్టాభిసీతారామయ్య", "b"),
("ఈ క్రింది వానిలో సురవరం ప్రతాపరెడ్డి గారి రచన కానిది ?", "గోల్కొండ కవుల సంచిక", "ఆంధ్రుల సాంఘిక చరిత్ర", "హిందువుల పండుగలు", "నిజాం రాష్ట్ర ఆంధ్రులు", "d"),
("1925లో గోల్కొండ పత్రికను స్థాపించిన వారు ?", "ప్రకాశం పంతులు", "భోగరాజు పట్టాభిసీతారామయ్య", "రఘుపతి వెంకటరత్నం నాయుడు", "సురవరం ప్రతాపరెడ్డి", "d"),
("నారాయణగూడలో స్త్రీలకు విద్యను అందించుటకు ప్రప్రథమంగా బాలికోన్నత పాఠశాలను స్థాపించిన వారు ఎవరు ?", "కొండ వెంకటరంగారెడ్డి", "బూర్గుల రామకృష్ణారావు", "మాడపాటి హనుమంతరావు", "ఎన్.జి. రంగా", "c"),
("తెలంగాణ రైతుల సాయుధ పోరాటంనకు నాయకత్వం వహించిన వారిలో ముఖ్యుడు ?", "మాడపాటి హనుమంతరావు", "సురవరం ప్రతాపరెడ్డి", "స్వామి రామనంద తీర్థ", "రావి నారాయణరెడ్డి", "d"),
("మద్రాసు నగరంలో ఆంధ్ర మహిళ సభను ప్రారంభించిన వారు ఎవరు ?", "మాడపాటి హనుమంతరావు", "దుర్గాభాయి దేశ్‍ముఖ్", "వి.వి. గిరి", "సర్వేపల్లి రాధాకృష్ణ", "b"),
("ఆంధ్రాలో మొదట స్త్రీల కోసం స్థాపించబడిన పత్రిక ఏది ?", "సతీహిత భోధిని", "వివేక వర్ధిని", "హాస్య సంజీవని", "సత్యదూత", "a"),
("తిరుమల శ్రీ వెంకటేశ్వరుని స్థుతిస్తూ దాదాపు 32వేల కీర్తనలను కూర్చునవారు ?", "బమ్మెర పోతన", "క్షేత్రయ్య", "వేమన", "తాళ్ళాపాక అన్నమాచార్యులు", "d"),
("వీరభద్ర విజయం, భోగిని దండకం రచనలకు రచించినవారు ?", "వేమన", "క్షేత్రయ్య", "బమ్మెర పోతన", "తిక్కన", "c"),
("సుమతి శతకం, వేమన శతకం రచించిన వారు ?", "వేమన", "బమ్మెర పోతన", "నన్నయ్య", "ఎర్రన", "a"),
("కూచిపూడి నృత్యరీతులకు కారణాలైన మువ్వపదాలను రచించినవారు ?", "క్షేత్రయ్య", "బమ్మెర పోతన", "తాళ్ళాపాక అన్నమాచార్యులు", "దాశరథి కృష్ణమాచార్యులు", "a"),
("మాలపల్లి నవల రచయిత ఎవరు ?", "కాళోజి నారాయణ", "దాశరథి కృష్ణమాచార్యులు", "తాపి ధర్మారావు", "ఉన్నవ లక్ష్మీనారాయణ", "d"),
("1922లో స్త్రీ విద్యను ప్రోత్సహించేందుకు గుంటూరులో శారదానికేతన్‍ను స్థాపించిన వారు ?", "కాళోజి నారాయణ", "బోయి భీమన్న", "ఉన్నవ లక్ష్మీనారాయణ", "ముట్నూరి కృష్ణారావు", "c"),
("తెలంగాణ రచయితల సంఘంను స్థాపించి సాహిత్య ఉద్యమాన్ని నడిపినవారు ?", "రాయప్రోలు సుబ్బారావు", "శ్రీరంగం శ్రీనివాసరావు", "తాపి ధర్మరావు", "దాశరధి కృష్ణమాచార్యులు", "d"),
("నా తెలంగాణ కోటి రతనాల వీణ అనే గేయంను ప్రచారం చేసినవారు ?", "కాళోజి నారాయణ", "సి. నారాయణరెడ్డి", "దాశరథి కృష్ణమాచార్యులు", "భోయి భీమన్న", "c"),
("సి. నారాయణరెడ్డి రచించిన ఏ కవిత సంకలనానికి జ్ఞానపీఠ అవార్డును అందుకున్నారు ?", "శ్రీ మద్రామయణ కల్పవృక్షం", "వేయిపడగలు", "కర్పూర వసంతరాములు", "విశ్వంభర", "d"),
("1966లో విశాఖ ఉక్కు - ఆంధ్రుల హక్కు అనే ఉద్యమానికి ఎవరు నాయకత్వం వహించారు ?", "చండ్ర రాజేశ్వరరావు", "తెన్నేటి విశ్వనాథం", "పుచ్చలపల్లి సుందరయ్య", "సురవరం ప్రతాపరెడ్డి", "b"),
("బ్రహ్మాణేతరుల రచయితల సమావేశము 1927లో తెనాలిలో ఎవరి అధ్యక్షతన జరిగింది ?", "తెన్నేటి విశ్వనాథం", "తాపి ధర్మరావు", "పుచ్చలపల్లి సుందరయ్య", "చండ్ర రాజేశ్వరరావు", "b"),
("చందమామ రావే - జాబిల్లి రావే గీత రచయిత ఎవరు ?", "రాయప్రోలు సుబ్బారావు", "గరిమెళ్ళ సత్యనారాయణ", "తాళ్లపాక అన్నమాచార్యులు", "శంకరంబాడి సుందరాచారి", "c"),
("మా తెలుగు తల్లికి మల్లెపూదం గేయ రచయిత ఎవరు ?", "గూడవల్లి రామబ్రహ్మం", "శంకరంబాడి సుందరాచారి", "గరిమెళ్ళ సత్యనారాయణ", "సోమసుందర్", "b"),
("దేశోద్దారక గ్రంథమాలను స్థాపించిన వారు ?", "వట్టికోట ఆళ్వారుస్వామి", "రాయప్రోలు సుబ్బారావు", "సామ సుందర్", "నండూరి వెంకటసుబ్బారావు", "a"),
("పాలేరు నుంచి పద్మశ్రీ వరకు అన్న పేరుతో తన జీవిత చరిత్రను వ్రాసిన వారు ?", "తాపి ధర్మారావు", "రాయప్రోలు సుబ్బారావు", "భోయి భీమన్న", "గరిమెళ్ళ సత్యనారాయణ", "c"),
("The Hindu view of life గ్రంథ రచయిత ?", "నీలం సంజీవరెడ్డి", "జిడ్డు కృష్ణామూర్తి", "సర్వేపల్లి రాధాకృష్ణ", "పట్టాభి సీతారామయ్య", "c"),
("అమరజీవి అనే పేరు గల నాయకుడు ఎవరు ?", "మాడపాటి హనుమంతరావు", "పొట్టి శ్రీరాములు", "ప్రకాశం పంతులు", "నీలం సంజీవరెడ్డి", "b"),
("1919లో జన్మభూమి అనే ఆంగ్ల వార పత్రికను ప్రారంభించినవారు ఎవరు ?", "ప్రకాశం పంతులు", "గాడిచర్ల హరిసర్వోత్తమరావు", "న్యాపతి సుబ్బారావు", "పట్టాభి సీతారామయ్య", "d"),
]

def getinfodata():

    output = "# -*- coding: utf-8 -*-"+"\n\n"
    output += "ques_ans = [\n"
    for question, option1, option2, option3, option4, correct_answer in questions_answers:
        question = question.strip()
        if not question.endswith('?'):
            if question.endswith('.'):
                question = question[:-1].strip() + '?'
            else:
                question = question + '?'
        else:
            question = question[:-1].strip() + '?'

        # options = {'A': option1, 'B': option2, 'C': option3, 'D': option4}
        options = {'a': option1, 'b': option2, 'c': option3, 'd': option4}
        # options = {'1': option1, '2': option2, '3': option3, '4': option4}
        resp = options.get(correct_answer, "")
        output += f'    ("{question}","{option1.strip()}","{option2.strip()}","{option3.strip()}","{option4.strip()}","{resp.strip()}"),\n'
    output += "]\n"

    with open("19.ప్రముఖ వ్యక్తులు - కవులు.txt", "w", encoding="utf-8") as file:
        file.write(output)

getinfodata()
